thooge/esp32-nmea2000-obp60/lib/obp60task/OBPSensorTask.cpp
    // Settings for 1Wire bus
    String oneWireOn=api->getConfig()->getConfigItem(api->getConfig()->useTempSensor,true)->asString();
    int numberOfDevices;
    if(String(oneWireOn) == "DS18B20"){
        ds18b20.begin();
        DeviceAddress tempDeviceAddress;
        numberOfDevices = ds18b20.getDeviceCount();
        // Limit for 8 sensors
        if(numberOfDevices > 8){
            numberOfDevices = 8;
        }
        if (numberOfDevices < 1) {
            oneWire_ready = false;
            api->getLogger()->logDebug(GwLog::ERROR,"Modul DS18B20 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"1Wire modul found at:");
            for(int i=0;i<numberOfDevices; i++){
                // Search the wire for address
                if(ds18b20.getAddress(tempDeviceAddress, i)){
                    api->getLogger()->logDebug(GwLog::LOG,"DS18B20-%01d: %12d", i, tempDeviceAddress[i]);
                } else {
                    api->getLogger()->logDebug(GwLog::LOG,"DS18B20-%01d: Sensor with errors, check wiring!", i);
                }
            }        
            oneWire_ready = true;
        }
    }

    // Settings for RTC
    String rtcOn=api->getConfig()->getConfigItem(api->getConfig()->useRTC,true)->asString();
    if(String(rtcOn) == "DS1388"){
        if (!ds1388.begin()) {
            RTC_ready = false;
            api->getLogger()->logDebug(GwLog::ERROR,"Modul DS1388 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul DS1388 found");
            uint year = ds1388.now().year();
            if(year < 2023){
                // ds1388.adjust(DateTime(__DATE__, __TIME__));  // Set date and time from PC file time
            }
            RTC_ready = true;
            sensors.rtcValid = true;
        }
    }

    // Settings for GPS sensors
    String gpsOn=api->getConfig()->getConfigItem(api->getConfig()->useGPS,true)->asString();
    uint hdopAccuracy = uint(api->getConfig()->getConfigItem(api->getConfig()->hdopAccuracy,true)->asInt());
    if(String(gpsOn) == "NEO-6M"){
        Serial2.begin(9600, SERIAL_8N1, OBP_GPS_RX, OBP_GPS_TX, false); // not inverted (false)
        if (!Serial2) {     
            api->getLogger()->logDebug(GwLog::ERROR,"GPS modul NEO-6M not found, check wiring");
            GPS_ready = false;
            }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"GPS modul NEO-M6 found");
            NMEA0183.SetMessageStream(&Serial2);
            NMEA0183.Open();
            GPS_ready = true;
        }
    }
    if(String(gpsOn) == "NEO-M8N"){
        Serial2.begin(9600, SERIAL_8N1, OBP_GPS_RX, OBP_GPS_TX, false); // not inverted (false)
        if (!Serial2) {     
            api->getLogger()->logDebug(GwLog::ERROR,"GPS modul NEO-M8N not found, check wiring");
            GPS_ready = false;
            }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"GPS modul NEO-M8N found");
            NMEA0183.SetMessageStream(&Serial2);
            NMEA0183.Open();
            GPS_ready = true;
        }
    }
    if(String(gpsOn) == "ATGM336H"){
        Serial2.begin(9600, SERIAL_8N1, OBP_GPS_RX, OBP_GPS_TX, false); // not inverted (false)
        if (!Serial2) {     
            api->getLogger()->logDebug(GwLog::ERROR,"GPS modul ATGM336H not found, check wiring");
            GPS_ready = false;
            }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"GPS modul ATGM336H found");
            NMEA0183.SetMessageStream(&Serial2);
            NMEA0183.Open();
            GPS_ready = true;
        }
    }
    
    // Settings for environment sensors on I2C bus
    String envSensors=api->getConfig()->getConfigItem(api->getConfig()->useEnvSensor,true)->asString();

    if(String(envSensors) == "BME280"){
        if (!bme280.begin(BME280_I2C_ADDR)) {
            api->getLogger()->logDebug(GwLog::ERROR,"Modul BME280 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul BME280 found");
            sensors.airTemperature = bme280.readTemperature();
            sensors.airPressure = bme280.readPressure();
            sensors.airHumidity = bme280.readHumidity();
            BME280_ready = true;
        }
    }
    else if(String(envSensors) == "BMP280"){
        if (!bmp280.begin(BMP280_I2C_ADDR)) {
            api->getLogger()->logDebug(GwLog::ERROR,"Modul BMP280 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul BMP280 found");
            sensors.airTemperature = bmp280.readTemperature();
            sensors.airPressure = bmp280.readPressure();
            BMP280_ready = true;
        }
    }
    else if(String(envSensors) == "BMP085" || String(envSensors) == "BMP180"){
        if (!bmp085.begin()) {
            api->getLogger()->logDebug(GwLog::ERROR,"Modul BMP085/BMP180 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul BMP085/BMP180 found");
            sensors.airTemperature = bmp085.readTemperature();
            sensors.airPressure = bmp085.readPressure();
            BMP180_ready = true;
        }
    }
    else if(String(envSensors) == "HTU21" || String(envSensors) == "SHT21"){
        if (!sht21.begin()) {
            api->getLogger()->logDebug(GwLog::ERROR,"Modul HTU21/SHT21 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul HTU21/SHT21 found");
            sensors.airHumidity = sht21.readCompensatedHumidity();
            sensors.airTemperature = sht21.readTemperature();
            SHT21_ready = true;
        }
    }

    // Settings for rotation sensors AS5600 on I2C bus
    String envsensor = api->getConfig()->getConfigItem(api->getConfig()->useEnvSensor, true)->asString();
    String rotsensor = api->getConfig()->getConfigItem(api->getConfig()->useRotSensor, true)->asString();
    String rotfunction = api->getConfig()->getConfigItem(api->getConfig()->rotFunction, true)->asString();
    String rotSensor=api->getConfig()->getConfigItem(api->getConfig()->useRotSensor,true)->asString();
    
