thooge/esp32-nmea2000-obp60/lib/obp60task/OBPSensorTask.cpp
    if(String(rotSensor) == "AS5600"){
        Wire.beginTransmission(AS5600_I2C_ADDR);
        if (Wire.endTransmission() != 0) {
            api->getLogger()->logDebug(GwLog::ERROR,"Modul AS5600 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul AS5600 found");
            sensors.rotationAngle = DegToRad(as5600.getRawAngle() * 0.087);   // 0...4095 segments = 0.087 degree
            //sensors.magnitude = as5600.getMagnitude();              // Magnetic magnitude in [mT]
            AS5600_ready = true;
        }
    }

    // Settings for power amangement sensors INA226 #1 for Battery on I2C bus
    String shunt1 = api->getConfig()->getConfigItem(api->getConfig()->shunt1, true)->asString();
    // Settings for power amangement sensors INA226 #1 for Solar on I2C bus
    String powsensor2 = api->getConfig()->getConfigItem(api->getConfig()->usePowSensor2, true)->asString();
    String shunt2 = api->getConfig()->getConfigItem(api->getConfig()->shunt2, true)->asString();
    // Settings for power amangement sensors INA226 #1 for Generator on I2C bus
    String powsensor3 = api->getConfig()->getConfigItem(api->getConfig()->usePowSensor3, true)->asString();
    String shunt3 = api->getConfig()->getConfigItem(api->getConfig()->shunt3, true)->asString();

    float shuntResistor = 1.0;  // Default value for shunt resistor
    float maxCurrent = 10.0;    // Default value for max. current
    float corrFactor = 1;       // Correction factor for fix calibration
    
    // Battery sensor initialization
    if(String(powsensor1) == "INA226"){
        if (!ina226_1.begin()){
            api->getLogger()->logDebug(GwLog::ERROR,"Modul 1 INA226 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul 1 INA226 found");
            shuntResistor = SHUNT_VOLTAGE / float(shunt1.toInt());  // Calculate shunt resisitor for max. shunt voltage 75mV
            maxCurrent = shunt1.toFloat();
            api->getLogger()->logDebug(GwLog::LOG,"Calibation Modul 2 INA226, Imax:%3.0fA Rs:%7.5fOhm Us:%5.3f", maxCurrent, shuntResistor, SHUNT_VOLTAGE);
//            ina226_1.setMaxCurrentShunt(maxCurrent, shuntResistor);
            ina226_1.setMaxCurrentShunt(10, 0.01);  // Calibration with fix values (because the original values outer range)
            corrFactor = (maxCurrent / 10) * (0.001 / shuntResistor) / (maxCurrent / 100); // Correction factor for fix calibration
            sensors.batteryVoltage = ina226_1.getBusVoltage();
            sensors.batteryCurrent = ina226_1.getCurrent() * corrFactor;
            sensors.batteryPower = ina226_1.getPower() * corrFactor;
            // Fill average arrays with start values
            for (int i=1; i<=avgsize+1; ++i) {
                batV.reading(int(sensors.batteryVoltage * 100));
                batC.reading(int(sensors.batteryCurrent * 10));
            }
            INA226_1_ready = true;
        }
    }

    // Solar sensor initialization
    if(String(powsensor2) == "INA226"){
        if (!ina226_2.begin()){
            api->getLogger()->logDebug(GwLog::ERROR,"Modul 2 INA226 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul 2 INA226 found");
            shuntResistor = SHUNT_VOLTAGE / float(shunt2.toInt());  // Calculate shunt resisitor for max. shunt voltage 75mV
            maxCurrent = shunt2.toFloat();
            api->getLogger()->logDebug(GwLog::LOG,"Calibation Modul 2 INA226, Imax:%3.0fA Rs:%7.5fOhm Us:%5.3f", maxCurrent, shuntResistor, SHUNT_VOLTAGE);
//            ina226_1.setMaxCurrentShunt(maxCurrent, shuntResistor);
            ina226_2.setMaxCurrentShunt(10, 0.01);  // Calibration with fix values (because the original values outer range)
            corrFactor = (maxCurrent / 10) * (0.001 / shuntResistor) / (maxCurrent / 100); // Correction factor for fix calibration
            sensors.solarVoltage = ina226_2.getBusVoltage();
            sensors.solarCurrent = ina226_2.getCurrent() * corrFactor;
            sensors.solarPower = ina226_2.getPower() * corrFactor;
            // Fill average arrays with start values
            INA226_2_ready = true;
        }
    }

    // Generator sensor initialization
    if(String(powsensor3) == "INA226"){
        if (!ina226_3.begin()){
            api->getLogger()->logDebug(GwLog::ERROR,"Modul 3 INA226 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul 3 INA226 found");
            shuntResistor = SHUNT_VOLTAGE / float(shunt3.toInt());  // Calculate shunt resisitor for max. shunt voltage 75mV
            maxCurrent = shunt3.toFloat();
            api->getLogger()->logDebug(GwLog::LOG,"Calibation Modul 3 INA226, Imax:%3.0fA Rs:%7.5fOhm Us:%5.3f", maxCurrent, shuntResistor, SHUNT_VOLTAGE);
//            ina226_1.setMaxCurrentShunt(maxCurrent, shuntResistor);
            ina226_3.setMaxCurrentShunt(10, 0.01);  // Calibration with fix values (because the original values outer range)
            corrFactor = (maxCurrent / 10) * (0.001 / shuntResistor) / (maxCurrent / 100); // Correction factor for fix calibration
            sensors.generatorVoltage = ina226_3.getBusVoltage();
            sensors.generatorCurrent = ina226_3.getCurrent() * corrFactor;
            sensors.generatorPower = ina226_3.getPower() * corrFactor;
            // Fill average arrays with start values
            INA226_3_ready = true;
        }
    }

    // Boat data history buffer initialization
    // later, read data types from config and specify hstryValList accordingly
    GwApi::BoatValue *twdBVal=new GwApi::BoatValue(GwBoatData::_TWD);
    GwApi::BoatValue *twsBVal=new GwApi::BoatValue(GwBoatData::_TWS);
    GwApi::BoatValue *dbtBVal=new GwApi::BoatValue(GwBoatData::_DBT);
    GwApi::BoatValue *hstryValList[]={twdBVal, twsBVal, dbtBVal}; // List of boat values for history storage
    api->getBoatDataValues(3, hstryValList);
    int hstryUpdFreq = 1000; // Update frequency for history buffers in ms
    int hstryMinVal = 0; // Minimum value for these history buffers
    int twdHstryMax = 6283; // Max value for wind direction (TWD) in rad (0...2*PI), shifted by 1000 for 3 decimals
    int twsHstryMax = 1000; // Max value for wind speed (TWS) in m/s, shifted by 10 for 1 decimal
    int dbtHstryMax = 3276; // Max value for depth in m (=327), shifted by 10 for 1 decimal
    // Initialize history buffers with meta data
    twdHstry.setMetaData(twdBVal->getName(), twdBVal->getFormat(), hstryUpdFreq, hstryMinVal, twdHstryMax);
    twsHstry.setMetaData(twsBVal->getName(), twsBVal->getFormat(), hstryUpdFreq, hstryMinVal, twsHstryMax);
    dbtHstry.setMetaData(dbtBVal->getName(), dbtBVal->getFormat(), hstryUpdFreq, hstryMinVal, dbtHstryMax);
    bool simulation = api->getConfig()->getBool(api->getConfig()->useSimuData, false);

    int rotoffset = api->getConfig()->getConfigItem(api->getConfig()->rotOffset,true)->asInt();

    static long loopCounter = 0;    // Loop counter for 1Wire data transmission
    long starttime0 = millis();     // GPS update all 100ms
    long starttime5 = millis();     // Voltage update all 1s
    long starttime6 = millis();     // Environment sensor update all 1s
    long starttime7 = millis();     // Rotation sensor update all 500ms
    long starttime8 = millis();     // Battery power sensor update all 1s
    long starttime9 = millis();     // Solar power sensor update all 1s
    long starttime10 = millis();    // Generator power sensor update all 1s
    long starttime11 = millis();    // Copy GPS data to RTC all 5min
    long starttime12 = millis();    // Get RTC data all 500ms
    long starttime13 = millis();    // Get 1Wire sensor data all 2s
    unsigned long starttime20 = millis(); // Get history TWD, TWS, DBT data each 1s

