thooge/esp32-nmea2000-obp60/lib/obp60task/OBPSensorTask.cpp
    tN2kMsg N2kMsg;
    shared->setSensorData(sensors); //set initially read values

    GwApi::BoatValue *gpsdays=new GwApi::BoatValue(GwBoatData::_GPSD);
    GwApi::BoatValue *gpsseconds=new GwApi::BoatValue(GwBoatData::_GPST);
    GwApi::BoatValue *hdop=new GwApi::BoatValue(GwBoatData::_HDOP);
    GwApi::BoatValue *valueList[]={gpsdays, gpsseconds, hdop};

    // Internal RTC with NTP init
    ESP32Time rtc(0);
    if (api->getConfig()->getString(api->getConfig()->timeSource) == "iRTC") {
        GwApi::Status status;
        api->getStatus(status);
        if (status.wifiClientConnected) {
            const char *ntpServer = api->getConfig()->getCString(api->getConfig()->timeServer);
            api->getLogger()->logDebug(GwLog::LOG,"Fetching date and time from NTP server '%s'.", ntpServer);
            configTime(0, 0, ntpServer); // get time in UTC
            struct tm timeinfo;
            if (getLocalTime(&timeinfo)) {
                api->getLogger()->logDebug(GwLog::LOG,"NTP time: %04d-%02d-%02d %02d:%02d:%02d UTC", timeinfo.tm_year+1900, timeinfo.tm_mon+1, timeinfo.tm_mday, timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec);
                rtc.setTimeStruct(timeinfo);
                sensors.rtcValid = true;
            } else {
                api->getLogger()->logDebug(GwLog::LOG,"NTP time fetch failed!");
            }
        } else {
            api->getLogger()->logDebug(GwLog::LOG,"Wifi client not connected, NTP not available.");
        }
    }

    // Sensor task loop runs with 100ms
    //####################################################################################

    while (true){
        delay(100);                 // Loop time 100ms
        Timer1.update();            // Update for Timer2
        if (millis() > starttime0 + 100)
        {
            starttime0 = millis();
            // Send NMEA0183 GPS data on several bus systems all 100ms
            if (GPS_ready == true && hdop->value <= hdopAccuracy)
            {
                SNMEA0183Msg NMEA0183Msg;
                while (NMEA0183.GetMessageCor(NMEA0183Msg))
                {
                    api->sendNMEA0183Message(NMEA0183Msg);
                }
            }
            
        }

        // If RTC DS1388 ready, then copy GPS data to RTC all 5min
        if(millis() > starttime11 + 5*60*1000){
            starttime11 = millis();
            if(rtcOn == "DS1388" && RTC_ready == true && GPS_ready == true){
                api->getBoatDataValues(3,valueList);
                if(gpsdays->valid && gpsseconds->valid && hdop->valid){
                    long ts = tNMEA0183Msg::daysToTime_t(gpsdays->value - (30*365+7))+floor(gpsseconds->value); // Adjusted to reference year 2000 (-30 years and 7 days for switch years)
                    // sample input: date = "Dec 26 2009", time = "12:34:56"
                    // ds1388.adjust(DateTime("Dec 26 2009", "12:34:56"));
                    DateTime adjusttime(ts);
                    api->getLogger()->logDebug(GwLog::LOG,"Adjust RTC time: %04d/%02d/%02d %02d:%02d:%02d",adjusttime.year(), adjusttime.month(), adjusttime.day(), adjusttime.hour(), adjusttime.minute(), adjusttime.second());
                    // Adjust RTC time as unix time value
                    ds1388.adjust(adjusttime);
                }
            }
        }

        // Send 1Wire data for all temperature sensors all 2s
        if(millis() > starttime13 + 2000 && String(oneWireOn) == "DS18B20" && oneWire_ready == true){
            starttime13 = millis();
            float tempC;
            ds18b20.requestTemperatures();  // Collect all temperature values (max.8)
            for(int i=0;i<numberOfDevices; i++){
                // Send only one 1Wire data per loop step (time reduction)
                if(i == loopCounter % numberOfDevices){
                    if(ds18b20.getAddress(tempDeviceAddress, i)){
                        // Read temperature value in Celsius
                        tempC = ds18b20.getTempC(tempDeviceAddress); 
                    }
                    // Send to NMEA200 bus for each sensor with instance number
                    if(!isnan(tempC)){
                        sensors.onewireTemp[i] = tempC; // Save values in SensorData
                        api->getLogger()->logDebug(GwLog::DEBUG,"DS18B20-%1d Temp: %.1f",i,tempC);
                        SetN2kPGN130316(N2kMsg, 0, i, N2kts_OutsideTemperature, CToKelvin(tempC), N2kDoubleNA);
                        api->sendN2kMessage(N2kMsg);
                    }
                }    
            }
            loopCounter++;
        }

        // Get current RTC date and time all 500ms
        if (millis() > starttime12 + 500) {
            starttime12 = millis();
            if (rtcOn == "DS1388" && RTC_ready) {
                DateTime dt = ds1388.now();
                sensors.rtcTime.tm_year  = dt.year() - 1900; // Save values in SensorData
                sensors.rtcTime.tm_mon = dt.month() - 1;
                sensors.rtcTime.tm_mday = dt.day();
                sensors.rtcTime.tm_hour = dt.hour();
                sensors.rtcTime.tm_min = dt.minute();
                sensors.rtcTime.tm_sec = dt.second();
                sensors.rtcTime.tm_isdst = 0; // Not considering daylight saving time

                // If GPS not ready or installed then send RTC time on bus
                // TODO If there are other time sources on the bus there should
                //      be a logic not to send or to send with lower frequency
                //      or something totally different
                if ((GPS_ready == false) || (GPS_ready == true && hdop->valid == false)) {
                    // TODO implement daysAt1970 and sysTime as methods of DateTime
                    const short daysOfYear[12] = {0,31,59,90,120,151,181,212,243,273,304,334};
                    uint16_t switchYear = ((dt.year()-1)-1968)/4 - ((dt.year()-1)-1900)/100 + ((dt.year()-1)-1600)/400;
                    long daysAt1970 = (dt.year()-1970)*365 + switchYear + daysOfYear[dt.month()-1] + dt.day()-1;
                    // If switch year then add one day
                    if ((dt.month() > 2) && (dt.year() % 4 == 0  && (dt.year() % 100 != 0 || dt.year() % 400 == 0))) {
                        daysAt1970 += 1;
                    }
                    // N2K sysTime is double in n2klib
                    double sysTime = (dt.hour() * 3600) + (dt.minute() * 60) + dt.second();
                    // WHY? isnan should always fail here
                    //if(!isnan(daysAt1970) && !isnan(sysTime)){
                        //api->getLogger()->logDebug(GwLog::LOG,"RTC time: %04d/%02d/%02d %02d:%02d:%02d",sensors.rtcTime.tm_year+1900,sensors.rtcTime.tm_mon, sensors.rtcTime.tm_mday, sensors.rtcTime.tm_hour, sensors.rtcTime.tm_min, sensors.rtcTime.tm_sec);
                        //api->getLogger()->logDebug(GwLog::LOG,"Send PGN126992: %10d %10d",daysAt1970, (uint16_t)sysTime);
                        SetN2kPGN126992(N2kMsg,0,daysAt1970,sysTime,N2ktimes_LocalCrystalClock);
                        api->sendN2kMessage(N2kMsg);
                    // }
                }
            } else if (sensors.rtcValid) {
                // use internal rtc feature
                sensors.rtcTime = rtc.getTimeStruct();
            }
        }

        // Send supply voltage value all 1s
        if(millis() > starttime5 + 1000 && String(powsensor1) == "off"){
            starttime5 = millis();
            #ifdef VOLTAGE_SENSOR
            float rawVoltage = (float(analogRead(OBP_ANALOG0)) * 3.3 / 4096 + 0.53) * 2;   // Vin = 1/2 for OBP40
            #else
            float rawVoltage = (float(analogRead(OBP_ANALOG0)) * 3.3 / 4096 + 0.17) * 20;   // Vin = 1/20 for OBP60    
            #endif
            sensors.batteryVoltage = rawVoltage * vslope + voffset; // Calibration
            // Save new data in average array
            batV.reading(int(sensors.batteryVoltage * 100));
            // Calculate the average values for different time lines from integer values
            sensors.batteryVoltage10 = batV.getAvg(10) / 100.0;
            sensors.batteryVoltage60 = batV.getAvg(60) / 100.0;
            sensors.batteryVoltage300 = batV.getAvg(300) / 100.0;
            #if defined LIPO_ACCU_1200 && defined VOLTAGE_SENSOR
            // Polynomfit for LiPo capacity calculation for 3,7V LiPo accus, 0...100%
            sensors.batteryLevelLiPo = sensors.batteryVoltage60 * 203.8312 -738.1635;
            // Limiter
            if(sensors.batteryLevelLiPo > 100){
                sensors.batteryLevelLiPo = 100;
            }
            if(sensors.batteryLevelLiPo < 0){
                sensors.batteryLevelLiPo = 0;
            }
            // Charging detection
            float deltaV = sensors.batteryVoltage - sensors.batteryVoltage10;
            // Higher limits for lower voltages
            if(sensors.batteryVoltage10 < 4.0){
                if(deltaV > 0.045){
                    sensors.BatteryChargeStatus = 1;    // Charging active
                }
                if(deltaV < -0.04){
                    sensors.BatteryChargeStatus = 0;    // Discharging
                }
            }
            // Lower limits for higher voltages
            else{
                if(deltaV > 0.03){
                    sensors.BatteryChargeStatus = 1;    // Charging active
                }
                if(deltaV < -0.03){
                    sensors.BatteryChargeStatus = 0;    // Discharging
                }
            }
            // Charging stops by grater than 4,15V
            if(sensors.batteryVoltage10 > 4.15){
                sensors.BatteryChargeStatus = 0;        // Discharging
            }
            // Send to NMEA200 bus as instance 10
            if(!isnan(sensors.batteryVoltage)){
                SetN2kDCBatStatus(N2kMsg, 10, sensors.batteryVoltage, N2kDoubleNA, N2kDoubleNA, 0);
                api->sendN2kMessage(N2kMsg);
            }
            #endif
            #ifdef BOARD_OBP60S3
            // Send to NMEA200 bus
            if(!isnan(sensors.batteryVoltage)){
                SetN2kDCBatStatus(N2kMsg, 0, sensors.batteryVoltage, N2kDoubleNA, N2kDoubleNA, 1);
                api->sendN2kMessage(N2kMsg);
            }
            #endif
        }

