thooge/esp32-nmea2000-obp60/lib/obp60task/OBPSensorTask.cpp
        // Send battery power value all 1s
        if(millis() > starttime8 + 1000 && (String(powsensor1) == "INA219" || String(powsensor1) == "INA226")){
            starttime8 = millis();
            if(String(powsensor1) == "INA226" && INA226_1_ready == true){
                double voltage = ina226_1.getBusVoltage();
                // Limiter for voltage average building
                if(voltage < 0){
                    voltage = 0;
                }
                if(voltage > 30){
                    voltage = 30;
                }
                sensors.batteryVoltage = voltage;
                sensors.batteryCurrent = ina226_1.getCurrent() * corrFactor;
                // Eliminates bit jitter by zero current values
                float factor = maxCurrent / 100;
                if(sensors.batteryCurrent >= (-0.015 * factor) && sensors.batteryCurrent <= (0.015 * factor)){
                    sensors.batteryCurrent = 0;
                }
                // Save actual values in average arrays as integer values
                batV.reading(int(sensors.batteryVoltage * 100));
                batC.reading(int(sensors.batteryCurrent * 10));
                // Calculate the average values for different time lines from integer values
                sensors.batteryVoltage10 = batV.getAvg(10) / 100.0;
                sensors.batteryVoltage60 = batV.getAvg(60) / 100.0;
                sensors.batteryVoltage300 = batV.getAvg(300) / 100.0;
                sensors.batteryCurrent10 = batC.getAvg(10) / 10.0;
                sensors.batteryCurrent60 = batC.getAvg(60) / 10.0;
                sensors.batteryCurrent300 = batC.getAvg(300) / 10.0;
                sensors.batteryPower10 = sensors.batteryVoltage10 * sensors.batteryCurrent10;
                sensors.batteryPower60 = sensors.batteryVoltage60 * sensors.batteryCurrent60;
                sensors.batteryPower300 = sensors.batteryVoltage300 * sensors.batteryCurrent300;
//                sensors.batteryPower = ina226_1.getPower() * corrFactor;  // Real value
                sensors.batteryPower = sensors.batteryVoltage * sensors.batteryCurrent;  // Calculated power value (more stable)
            }
            // Send battery live data to NMEA200 bus
            if(!isnan(sensors.batteryVoltage) && !isnan(sensors.batteryCurrent)){
                SetN2kDCBatStatus(N2kMsg, 0, sensors.batteryVoltage, sensors.batteryCurrent, N2kDoubleNA, 1);
                api->sendN2kMessage(N2kMsg);
            }
        }

        // Send solar power value all 1s
        if(millis() > starttime9 + 1000 && (String(powsensor2) == "INA219" || String(powsensor2) == "INA226")){
            starttime9 = millis();
            if(String(powsensor2) == "INA226" && INA226_2_ready == true){
                double voltage = ina226_2.getBusVoltage();
                // Limiter for voltage average building
                if(voltage < 0){
                    voltage = 0;
                }
                if(voltage > 30){
                    voltage = 30;
                }
                sensors.solarVoltage = voltage;
                sensors.solarCurrent = ina226_2.getCurrent() * corrFactor;
                // Eliminates bit jitter by zero current values
                float factor = maxCurrent / 100;
                if(sensors.solarCurrent >= (-0.015 * factor) && sensors.solarCurrent <= (0.015 * factor)){
                    sensors.solarCurrent = 0;
                }
                
                // Calculate power value
                sensors.solarPower = sensors.solarVoltage * sensors.solarCurrent; // more stable
            }
            // Send solar live data to NMEA200 bus
            if(!isnan(sensors.solarVoltage) && !isnan(sensors.solarCurrent)){
                SetN2kDCBatStatus(N2kMsg, 1, sensors.solarVoltage, sensors.solarCurrent, N2kDoubleNA, 1);
                api->sendN2kMessage(N2kMsg);
            }
        }

        // Send generator power value all 1s
        if(millis() > starttime10 + 1000 && (String(powsensor3) == "INA219" || String(powsensor3) == "INA226")){
            starttime10 = millis();
            if(String(powsensor3) == "INA226" && INA226_3_ready == true){
                double voltage = ina226_3.getBusVoltage();
                // Limiter for voltage average building
                if(voltage < 0){
                    voltage = 0;
                }
                if(voltage > 30){
                    voltage = 30;
                }
                sensors.generatorVoltage = voltage;
                sensors.generatorCurrent = ina226_3.getCurrent() * corrFactor;
                // Eliminates bit jitter by zero current values
                float factor = maxCurrent / 100;
                if(sensors.generatorCurrent >= (-0.015 * factor) && sensors.generatorCurrent <= (0.015 * factor)){
                    sensors.generatorCurrent = 0;
                }
                
                // Calculate power value
                sensors.generatorPower = sensors.generatorVoltage * sensors.generatorCurrent; // more stable
            }
            // Send solar live data to NMEA200 bus
            if(!isnan(sensors.generatorVoltage) && !isnan(sensors.generatorCurrent)){
                SetN2kDCBatStatus(N2kMsg, 2, sensors.generatorVoltage, sensors.generatorCurrent, N2kDoubleNA, 1);
                api->sendN2kMessage(N2kMsg);
            }
        }

        // Read TWD, TWS, DBT data from boatData each 1000ms for history and windplot display
        if((millis() > starttime20 + 1000) && !simulation){
            int16_t val;
            starttime20 = millis();
            api->getBoatDataValues(3, hstryValList);
            if (twdBVal->valid) {
                val = static_cast<int16_t>(std::round(twdBVal->value * 1000)); // Shift value to store decimals in int16_t);
                if (val < hstryMinVal || val > twdHstryMax) {
                    val = INT16_MIN; // Add invalid value - to be fixed later
                }
            } else {
                val = INT16_MIN;
            }
            twdHstry.add(val);
            if (twsBVal->valid) {
                val = static_cast<int16_t>(twsBVal->value * 10); // Shift value to store decimals in int16_t
                if (val < hstryMinVal || val > twsHstryMax) {
                    val = INT16_MIN; // Add invalid value
                }
            } else {
                val = INT16_MIN;
            }
            twsHstry.add(val);
            if (dbtBVal->valid) {
                val = static_cast<int16_t>(dbtBVal->value * 10); // Shift value to store decimals in int16_t
                if (val < hstryMinVal || val > dbtHstryMax) {
                    val = INT16_MIN; // Add invalid value
                }
            } else {
                val = INT16_MIN;
            }
            dbtHstry.add(val);

            int counttime = millis() - starttime20;
            api->getLogger()->logDebug(GwLog::ERROR,"SensorTask write time: %d", counttime);
        }

        shared->setSensorData(sensors);
    }
    vTaskDelete(NULL);
}


void createSensorTask(SharedData *shared){
    xTaskCreate(sensorTask,"readSensors",10000,shared,3,NULL);
}
#endif
